In [3]:
# Load the data 
import numpy as np
import pandas as pd

In [5]:
df = pd.read_csv("Retail_Sales.csv")

In [7]:
df.head()

,Transaction ID,Date,Customer ID,Gender,Age,Product Category,Quantity,Price per Unit,Total Amount
0,1,2023-11-24,CUST001,Male,34,Beauty,3,50,150
1,2,2023-02-27,CUST002,Female,26,Clothing,2,500,1000
2,3,2023-01-13,CUST003,Male,50,Electronics,1,30,30
3,4,2023-05-21,CUST004,Male,37,Clothing,1,500,500
4,5,2023-05-06,CUST005,Male,30,Beauty,2,50,100

In [9]:
df

,Transaction ID,Date,Customer ID,Gender,Age,Product Category,Quantity,Price per Unit,Total Amount
0,1,2023-11-24,CUST001,Male,34,Beauty,3,50,150
1,2,2023-02-27,CUST002,Female,26,Clothing,2,500,1000
2,3,2023-01-13,CUST003,Male,50,Electronics,1,30,30
3,4,2023-05-21,CUST004,Male,37,Clothing,1,500,500
4,5,2023-05-06,CUST005,Male,30,Beauty,2,50,100
...,...,...,...,...,...,...,...,...,...
995,996,2023-05-16,CUST996,Male,62,Clothing,1,50,50
996,997,2023-11-17,CUST997,Male,52,Beauty,3,30,90
997,998,2023-10-29,CUST998,Female,23,Beauty,4,25,100
998,999,2023-12-05,CUST999,Female,36,Electronics,3,50,150
999,1000,2023-04-12,CUST1000,Male,47,Electronics,4,30,120

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 9 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Transaction ID    1000 non-null   int64
 1   Date              1000 non-null   object
 2   Customer ID       1000 non-null   object
 3   Gender            1000 non-null   object
 4   Age               1000 non-null   int64
 5   Product Category  1000 non-null   object
 6   Quantity          1000 non-null   int64
 7   Price per Unit    1000 non-null   int64
 8   Total Amount      1000 non-null   int64
dtypes: int64(5), object(4)
memory usage: 70.4+ KB

In [13]:
# Summary statistics using .describe()
df.describe(include = "all")

,Transaction ID,Date,Customer ID,Gender,Age,Product Category,Quantity,Price per Unit,Total Amount
count,1000.000000,1000,1000,1000,1000.00000,1000,1000.000000,1000.000000,1000.000000
unique,NaN,345,1000,2,NaN,3,NaN,NaN,NaN
top,NaN,2023-05-16,CUST001,Female,NaN,Clothing,NaN,NaN,NaN
freq,NaN,11,1,510,NaN,351,NaN,NaN,NaN
mean,500.500000,NaN,NaN,NaN,41.39200,NaN,2.514000,179.890000,456.000000
std,288.819436,NaN,NaN,NaN,13.68143,NaN,1.132734,189.681356,559.997632
min,1.000000,NaN,NaN,NaN,18.00000,NaN,1.000000,25.000000,25.000000
25%,250.750000,NaN,NaN,NaN,29.00000,NaN,1.000000,30.000000,60.000000
50%,500.500000,NaN,NaN,NaN,42.00000,NaN,3.000000,50.000000,135.000000
75%,750.250000,NaN,NaN,NaN,53.00000,NaN,4.000000,300.000000,900.000000
max,1000.000000,NaN,NaN,NaN,64.00000,NaN,4.000000,500.000000,2000.000000

In [15]:
df.isnull().sum()

Transaction ID      0
Date                0
Customer ID         0
Gender              0
Age                 0
Product Category    0
Quantity            0
Price per Unit      0
Total Amount        0
dtype: int64

In [17]:
# Renaming columns according to snake casing for better readability and documentation

df.columns = df.columns.str.lower()
df.columns = df.columns.str.replace(' ','_')

In [19]:
df.columns

Index(['transaction_id', 'date', 'customer_id', 'gender', 'age',
       'product_category', 'quantity', 'price_per_unit', 'total_amount'],
      dtype='object')

In [21]:
# create a new column age_group
labels = ['Young Adult', 'Adult', 'Middle-aged', 'Senior']
df['age_group'] = pd.qcut(df['age'], q=4, labels = labels)

In [23]:
df[['age','age_group']].head(10)

   age    age_group
0   34        Adult
1   26  Young Adult
2   50  Middle-aged
3   37        Adult
4   30        Adult
5   45  Middle-aged
6   46  Middle-aged
7   30        Adult
8   63       Senior
9   52  Middle-aged

In [25]:
df['date'] = pd.to_datetime(df['date'])
# create new column quartiles
labels = ['Q1', 'Q2', 'Q3', 'Q4']
df['quarters'] = pd.qcut(df['date'], q=4, labels=labels)

In [27]:
df[['date','quarters']].head(10)

        date quarters
0 2023-11-24       Q4
1 2023-02-27       Q1
2 2023-01-13       Q1
3 2023-05-21       Q2
4 2023-05-06       Q2
5 2023-04-25       Q2
6 2023-03-13       Q1
7 2023-02-22       Q1
8 2023-12-13       Q4
9 2023-10-07       Q4

In [29]:
(df['transaction_id'] == df['customer_id']).all()

False

In [31]:
df

,transaction_id,date,customer_id,gender,age,product_category,quantity,price_per_unit,total_amount,age_group,quarters
0,1,2023-11-24,CUST001,Male,34,Beauty,3,50,150,Adult,Q4
1,2,2023-02-27,CUST002,Female,26,Clothing,2,500,1000,Young Adult,Q1
2,3,2023-01-13,CUST003,Male,50,Electronics,1,30,30,Middle-aged,Q1
3,4,2023-05-21,CUST004,Male,37,Clothing,1,500,500,Adult,Q2
4,5,2023-05-06,CUST005,Male,30,Beauty,2,50,100,Adult,Q2
...,...,...,...,...,...,...,...,...,...,...,...
995,996,2023-05-16,CUST996,Male,62,Clothing,1,50,50,Senior,Q2
996,997,2023-11-17,CUST997,Male,52,Beauty,3,30,90,Middle-aged,Q4
997,998,2023-10-29,CUST998,Female,23,Beauty,4,25,100,Young Adult,Q4
998,999,2023-12-05,CUST999,Female,36,Electronics,3,50,150,Adult,Q4
999,1000,2023-04-12,CUST1000,Male,47,Electronics,4,30,120,Middle-aged,Q2

In [33]:
df.columns

Index(['transaction_id', 'date', 'customer_id', 'gender', 'age',
       'product_category', 'quantity', 'price_per_unit', 'total_amount',
       'age_group', 'quarters'],
      dtype='object')

In [35]:
!pip install pymysql sqlalchemy

Requirement already satisfied: pymysql in c:\users\msunk\anaconda3\lib\site-packages (1.1.2)
Requirement already satisfied: sqlalchemy in c:\users\msunk\anaconda3\lib\site-packages (2.0.30)
Requirement already satisfied: typing-extensions>=4.6.0 in c:\users\msunk\anaconda3\lib\site-packages (from sqlalchemy) (4.11.0)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\msunk\anaconda3\lib\site-packages (from sqlalchemy) (3.0.1)

In [36]:
from sqlalchemy import create_engine

# MySQL connection
username = "root"
password = "6305"
host = "127.0.0.1"
port = "3306"
database = "customer_behavior"

engine = create_engine(f"mysql+pymysql://{username}:{password}@{host}:{port}/{database}")

# Write DataFrame to MySQL
table_name = "customer"   # choose any table name
df.to_sql(table_name, engine, if_exists="replace", index=False)

# Read back sample
pd.read_sql("SELECT * FROM customer LIMIT 5;", engine)

,transaction_id,date,customer_id,gender,age,product_category,quantity,price_per_unit,total_amount,age_group,quarters
0,1,2023-11-24,CUST001,Male,34,Beauty,3,50,150,Adult,Q4
1,2,2023-02-27,CUST002,Female,26,Clothing,2,500,1000,Young Adult,Q1
2,3,2023-01-13,CUST003,Male,50,Electronics,1,30,30,Middle-aged,Q1
3,4,2023-05-21,CUST004,Male,37,Clothing,1,500,500,Adult,Q2
4,5,2023-05-06,CUST005,Male,30,Beauty,2,50,100,Adult,Q2

In [37]:
df.to_csv("cleaned_retail_data.csv", index=False)